<?php

use App\Company;
use Illuminate\Database\Seeder;

class CompanyTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Company::firstOrCreate([
            'email'             => 'igra.acter@gmail.com',
            'about'             => '<p>В современном обществе людям сложно чувствовать себя раскрепощёнными, управлять своими эмоциями, свободно общаться, быть уверенным в себе. Большинство чувствуют страх, агрессию, неуверенность, не могут выразить свои мысли, чувства. Эмоциональная подавленность приводит к внутренним зажимам, которые проявляются не только в мимике, речи, но и в движениях. Решить эти проблемы помогает курс по актёрскому мастерству.
                                        <br><br>
                                        Актёрское мастерство — набор упражнений, направленный не на освоение навыков профессии актёра, а развитие психофизического аспекта человека. Благодаря такой тренинговой программе человек учится раскрываться миру, избавляется от страхов и фобий, связанных с общением с другими людьми, выступлением перед публикой. Он становится прекрасным оратором, у него налаживаются отношения со всеми людьми, он идёт по жизни легко и играючи.
                                        <br><br>
                                        Начинается курс со знакомства с собой. Этот этап позволяет открыть в себе своё творческое "я", свободно и естественно выражать эмоции. И начинается курс с работы с голосом. Взволнованный голос выдаёт внутреннее состояние человека. Преподаватели помогут зазвучать голосу в полную силу, расширят его диапазон, улучшат тембр.
                                        Затем следует работа с речью, где разрабатываются органы речи с целью чёткого произношения. Это делают через различные пословицы, поговорки и др.
                                        Важную роль в речи играет интонация, придающая неповторимую окраску предложению.
                                        <br><br>
                                        Затем следуют упражнения по пластике тела, помогающие избавиться от зажимов, которые мешают свободно ощущать себя в пространстве. Но тело всего лишь отображает состояние души человека. Поэтому на курсе идёт глубокая проработка этого аспекта.
                                        Также изучается на этом этапе импровизация. Ведь невозможно общаться и жить по шаблону. Импровизация учит человека искренне реагировать на события.
                                        Психотехника поможет понять, откуда берутся страхи, негативные эмоции, даст человеку вдохновение и переступить через страх.
                                    </p>
                                    <div class="about-img"><img src="/imgs/about-img.png"></div>
                                    <p>В современном обществе людям сложно чувствовать себя раскрепощёнными, управлять своими эмоциями, свободно общаться, быть уверенным в себе. Большинство чувствуют страх, агрессию, неуверенность, не могут выразить свои мысли, чувства. Эмоциональная подавленность приводит к внутренним зажимам, которые проявляются не только в мимике, речи, но и в движениях. Решить эти проблемы помогает курс по актёрскому мастерству.
                                        <br><br>
                                        Актёрское мастерство — набор упражнений, направленный не на освоение навыков профессии актёра, а развитие психофизического аспекта человека. Благодаря такой тренинговой программе человек учится раскрываться миру, избавляется от страхов и фобий, связанных с общением с другими людьми, выступлением перед публикой. Он становится прекрасным оратором, у него налаживаются отношения со всеми людьми, он идёт по жизни легко и играючи.
                                        Начинается курс со знакомства с собой. Этот этап позволяет открыть в себе своё творческое "я", свободно и естественно выражать эмоции. И начинается курс с работы с голосом. Взволнованный голос выдаёт внутреннее состояние человека. Преподаватели помогут зазвучать голосу в полную силу, расширят его диапазон, улучшат тембр.
                                        <br><br>
                                        Затем следует работа с речью, где разрабатываются органы речи с целью чёткого произношения. Это делают через различные пословицы, поговорки и др.
                                        Важную роль в речи играет интонация, придающая неповторимую окраску предложению.
                                        <br><br>
                                        Затем следуют упражнения по пластике тела, помогающие избавиться от зажимов, которые мешают свободно ощущать себя в пространстве. Но тело всего лишь отображает состояние души человека. Поэтому на курсе идёт глубокая проработка этого аспекта.
                                        Также изучается на этом этапе импровизация. Ведь невозможно общаться и жить по шаблону. Импровизация учит человека искренне реагировать на события.
                                        Психотехника поможет понять, откуда берутся страхи, негативные эмоции, даст человеку вдохновение и переступить через страх.
                                    </p>',
            'address'           => 'проспект Абая 10а, уг.пр. Назарбаева.',
            'phone_number'      => '+7 707 221 98 91',
            'url_to_youtube'    => 'https://www.youtube.com/channel/UC5S1AmXPurVASShGZkMQQUA',
            'url_to_facebook'   => 'https://web.facebook.com/tmigra/',
            'url_to_instagram'  => 'https://www.instagram.com/tm_igra/',
            'map'               => 'https://yandex.kz/maps/-/CCBCzAka',
            'created_at'        => now(),
            'updated_at'        => now()
        ]);
    }
}
